// Неделя 05-11 октября


// Аплет - это особая разновидность программ н а J ava , предн азначенная для
// передачи через И нтернет и автоматического выпол н е н и я в среде , формируемой
// J аvа-совм ести м ы м браузеро м .
//Сервлет - это небольшая программа, выполняемая на стороне сервера.
// Сервлеты динамически реализуют дополнительные фун кции веб-сервера.

//Инкапсуляция представляет собой механизм программ и ровани я , объединяющ
// и й код и дан ные, которыми манипул ирует этот код, что позволяет предотвратить
// несанкциони рован н ы й доступ к дан н ы м извне и их н екорректное испол ь зование.

//Полиморфизм (от греческого слова, означающего " много фор м " ) - это свойство,
// позволяющее с помощью одного и нтерфейса обращаться к общему классу
// 38 J ava : руководство дпя нач и н а ющих, 7-е и здание
// действ и й .

/*
boolean - Представляет л огические значения true или false
byte - 8-разрядное целое число
char - Символ
double - Числовое значение с плавающей точкой двойной точности
float - Числовое значение с плавающей точкой одинарной точности
int - Целое число
long - Длинное целое число
short - Короткое число
 */

/*
hex = OxFF ; // соответствует десятичному числу 2 5 5
oct = 011 ; // соответствует десятичному числу 9
 */

/*
Управляющая последовательность - Описание
\'  - Одинарная кавычка
\"  - Двойная кавычка
\\  - Обратная косая черта
\r  - Возврат каретки
\n  - Перевод строки
\f  - Перевод страницы
\t  - Горизонтальная табуляция
\b  - Возврат на одну позицию
\ddd  - Восьмеричная константа ( где ddd - восьмеричное число)
\ uxxxx  -  Шестнадцатеричная константа ( где хххх - шестнадцатеричное число)
 */

/*
Оператор - значение
& - И
| - ИЛИ
^ - исключающее ИЛИ
|| - укороченное ИЛИ
&& - укороченное И
! - НЕ
 */

//Если хотя бы один операнд — String, Java автоматически превращает второй операнд в
// строку и выполняет конкатенацию. Это единственное исключение, где Java ведет себя как JS.
/*
Автоматическое преобразование типов в операци и присваи ван ия выпол няет-
ся при соблюдении следующих условий:
оба типа являются совместимыми;
целевой тип обладает более широким диапазоном допустимых значений, чем исходный.
 */
/*
long c = 3000000000;  // ❌ ОШИБКА КОМПИЛЯЦИИ!
long c = 3000000000L; // ✅ Работает. Буква L спасла ситуацию.
 */

/* - запуск
javac Main.java
java Main
 */


//разобрать
public class week1 {
    public static void main(String[] args) {
        int a = 3;
        int b = 5;
        System.out.println(a + b);
    }
}